; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v2)
		(pred_4 ?v8)
		(pred_2 ?v7)
		(pred_1 ?v7)
		(pred_3 ?v8 ?v7)
		(pred_5)
		(pred_6 ?v8))

   (:action op_1
       :parameters  (?v6 ?v1)
       :precondition (and (not-eq ?v6 ?v1) 
                          (pred_2 ?v6) (pred_2 ?v1) (pred_1 ?v6))
       :effect (and  (pred_1 ?v1)
		     (not (pred_1 ?v6))))


   (:action op_2
       :parameters (?v4 ?v3)
       :precondition  (and  (pred_4 ?v4) (pred_2 ?v3)
			    (pred_3 ?v4 ?v3) (pred_1 ?v3) (pred_5))
       :effect (and (pred_6 ?v4)
		    (not (pred_3 ?v4 ?v3)) 
		    (not (pred_5))))

   (:action op_3
       :parameters  (?v4  ?v3)
       :precondition  (and  (pred_4 ?v4) (pred_2 ?v3)
			    (pred_6 ?v4) (pred_1 ?v3))
       :effect (and (pred_3 ?v4 ?v3)
		    (pred_5)
		    (not (pred_6 ?v4)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_03 obj_07 obj_04 obj_01 
          obj_05 obj_06 obj_02 
)
(:init
(pred_2 obj_03)
(pred_2 obj_07)
(pred_2 obj_04)
(pred_2 obj_01)
(pred_4 obj_05)
(pred_4 obj_06)
(pred_4 obj_02)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(pred_5)
(pred_3 obj_05 obj_03)
(pred_3 obj_06 obj_01)
(pred_3 obj_02 obj_01)
(pred_1 obj_04)
)
(:goal
(and
(pred_3 obj_05 obj_07)
(pred_3 obj_06 obj_01)
(pred_3 obj_02 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_05 obj_07) (pred_1 obj_01))
    (sometime-before  (pred_3 obj_02 obj_04) (pred_1 obj_03))
  )
)
)

; plan
1. (op_1 obj_04 obj_01)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_01)
   goals met: 1 of 3
2. (op_2 obj_02 obj_01)
   deleted: (pred_3 obj_02 obj_01) (pred_5)
   added: (pred_6 obj_02)
   goals met: 1 of 3
3. (op_1 obj_01 obj_03)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_03)
   goals met: 1 of 3
4. (op_3 obj_02 obj_03)
   deleted: (pred_6 obj_02)
   added: (pred_3 obj_02 obj_03) (pred_5)
   goals met: 1 of 3
5. (op_2 obj_05 obj_03)
   deleted: (pred_3 obj_05 obj_03) (pred_5)
   added: (pred_6 obj_05)
   goals met: 1 of 3
6. (op_1 obj_03 obj_07)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_07)
   goals met: 1 of 3
7. (op_3 obj_05 obj_07)
   deleted: (pred_6 obj_05)
   added: (pred_3 obj_05 obj_07) (pred_5)
   goals met: 2 of 3
8. (op_1 obj_07 obj_03)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_03)
   goals met: 2 of 3
9. (op_2 obj_02 obj_03)
   deleted: (pred_3 obj_02 obj_03) (pred_5)
   added: (pred_6 obj_02)
   goals met: 2 of 3
10. (op_1 obj_03 obj_04)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_04)
   goals met: 2 of 3
11. (op_3 obj_02 obj_04)
   deleted: (pred_6 obj_02)
   added: (pred_3 obj_02 obj_04) (pred_5)
   goals met: 3 of 3
